Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionRadial Properties
The CurvedDimensionRadial type exposes the following members.
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
 (Inherited from CurvedDimensionBase.)
ArcPoint2
 Gets the second arc point.
 (Inherited from CurvedDimensionBase.)
ArcPoint3
 Gets the third arc point.
 (Inherited from CurvedDimensionBase.)
Attributes
 Gets or sets the curved dimension set base attributes.
 (Inherited from CurvedDimensionBase.)
Distance
 Gets the distance.
 (Inherited from CurvedDimensionBase.)
EndPoint
 The end point of the dimension.
 (Inherited from CurvedDimensionBase.)
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from DimensionBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
StartPoint
 The start point of the dimension.
 (Inherited from CurvedDimensionBase.)
Top
See Also
Reference
CurvedDimensionRadial Class
Tekla.Structures.Drawing Namespace